Infineon/mtb-example-psoc-edge-gfx-vglite/proj_cm55/main.c
/*******************************************************************************
* File Name        : main.c
*
* Description      : This source file contains the main routine for CM55 CPU
*
* Related Document : See README.md
*
********************************************************************************
* Copyright 2025, Cypress Semiconductor Corporation (an Infineon company) or
* an affiliate of Cypress Semiconductor Corporation.  All rights reserved.
*
* This software, including source code, documentation and related
* materials ("Software") is owned by Cypress Semiconductor Corporation
* or one of its affiliates ("Cypress") and is protected by and subject to
* worldwide patent protection (United States and foreign),
* United States copyright laws and international treaty provisions.
* Therefore, you may use this Software only as provided in the license
* agreement accompanying the software package from which you
* obtained this Software ("EULA").
* If no EULA applies, Cypress hereby grants you a personal, non-exclusive,
* non-transferable license to copy, modify, and compile the Software
* source code solely for use in connection with Cypress's
* integrated circuit products.  Any reproduction, modification, translation,
* compilation, or representation of this Software except as specified
* above is prohibited without the express written permission of Cypress.
*
* Disclaimer: THIS SOFTWARE IS PROVIDED AS-IS, WITH NO WARRANTY OF ANY KIND,
* EXPRESS OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, NONINFRINGEMENT, IMPLIED
* WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. Cypress
* reserves the right to make changes to the Software without notice. Cypress
* does not assume any liability arising out of the application or use of the
* Software or any product or circuit described in the Software. Cypress does
* not authorize its products for use in any products where a malfunction or
* failure of the Cypress product may reasonably be expected to result in
* significant property damage, injury or death ("High Risk Product"). By
* including Cypress's product in a High Risk Product, the manufacturer
* of such system or application assumes all risk of such use and in doing
* so agrees to indemnify Cypress against all liability.
*******************************************************************************/

/*******************************************************************************
* Header Files
*******************************************************************************/
#include "retarget_io_init.h"
#include "vg_lite_platform.h"
#include "cybsp.h"
#include "cy_time.h"
#include "cycfg_peripherals.h"
#include "vglite_demos.h"
#include "task.h"
#include "cyabs_rtos.h"
#include "cyabs_rtos_impl.h"
#include "mtb_disp_dsi_waveshare_4p3.h"

/*******************************************************************************
* Macros
*******************************************************************************/
#define GFX_TASK_NAME                       ("CM55 Gfx Task")
#define GFX_TASK_STACK_SIZE                 (configMINIMAL_STACK_SIZE)
#define GFX_TASK_PRIORITY                   (configMAX_PRIORITIES - 1)


#define UART_CLI_TASK_NAME                  ("UART CLI Task")
#define UART_CLI_TASK_STACK_SIZE            (configMINIMAL_STACK_SIZE * 2)
#define UART_CLI_TASK_PRIORITY              (configMAX_PRIORITIES - 1)

#define GFX_TASK_DELAY_MS                   (16U)
#define DC_INT_PRIORITY                     (3U)
#define GPU_INT_PRIORITY                    (3U)
#define I2C_CONTROLLER_IRQ_PRIORITY         (2UL)

#define COLOR_DEPTH                         (16U)
#define BITS_PER_PIXEL                      (8U)
#define APP_BUFFER_COUNT                    (3U)

#define DISP_H                              (480U)
#define DISP_W                              (832U)
#define DISP_W_ACTUAL                       (800U)

#define ALIGN_128                           (128U)
/* 64 KB */
#define DEFAULT_GPU_CMD_BUFFER_SIZE         ((64U) * (1024U))

#define GPU_TESSELLATION_BUFFER_SIZE        ((DISP_H) * 128U)

#define FRAME_BUFFER_SIZE                   ((DISP_W) * (DISP_H) * \
                                             ((COLOR_DEPTH) / (BITS_PER_PIXEL)))

#define VGLITE_HEAP_SIZE                    (((FRAME_BUFFER_SIZE) * \
                                              (APP_BUFFER_COUNT)) + \
                                              ((DEFAULT_GPU_CMD_BUFFER_SIZE) * \
                                               (APP_BUFFER_COUNT)) + \
                                              ((GPU_TESSELLATION_BUFFER_SIZE) * \
                                               (APP_BUFFER_COUNT)))

#define GPU_MEM_BASE                        (0x0U)


#define TARGET_NUM_FRAMES                   (60U)


/* Rotation and scaling parameters */
#define DEF_X_SCALE                         (0.3f)
#define DEF_Y_SCALE                         (0.3f)
#define TRANSFORMATION_OFFSET               (2U)
#define VG_PARAMS_POS                       (0UL)

/* Enabling or disabling a MCWDT requires a wait time of upto 2 CLK_LF cycles
 * to come into effect. This wait time value will depend on the actual CLK_LF
 * frequency set by the BSP.
 */
#define LPTIMER_1_WAIT_TIME_USEC            (62U)

/* Define the LPTimer interrupt priority number. '1' implies highest priority.*/
#define APP_LPTIMER_INTERRUPT_PRIORITY      (1U)


/*******************************************************************************
* Global Variables
*******************************************************************************/
static mtb_hal_rtc_t rtc_obj;

GFXSS_Type* base = (GFXSS_Type*) GFXSS;

cy_stc_gfx_context_t gfx_context;
vg_lite_buffer_t buffer0;
vg_lite_buffer_t buffer1;
vg_lite_buffer_t intermediate_buffer;

vg_lite_buffer_t *render_target;
vg_lite_matrix_t matrix;

QueueHandle_t event_queque;

bool cancel_requested = false;
volatile bool fb_pending        = false;

/* Heap memory for VGLite to allocate memory for buffers, command, and
   tessellation buffers */
CY_SECTION(".cy_gpu_buf") uint8_t contiguous_mem[VGLITE_HEAP_SIZE] = { 0xFF };

volatile void *vglite_heap_base = &contiguous_mem;

