Infineon/mtb-example-psoc-edge-gfx-vglite/proj_cm55/main.c
    /* Initialize the MCWDT block */
    cy_en_mcwdt_status_t mcwdt_init_status =
                                    Cy_MCWDT_Init(CYBSP_CM55_LPTIMER_1_HW,
                                                &CYBSP_CM55_LPTIMER_1_config);

    /* MCWDT initialization failed. Stop program execution. */
    if (CY_MCWDT_SUCCESS != mcwdt_init_status)
    {
        handle_app_error();
    }

    /* Enable MCWDT instance */
    Cy_MCWDT_Enable(CYBSP_CM55_LPTIMER_1_HW,
                    CY_MCWDT_CTR_Msk,
                    LPTIMER_1_WAIT_TIME_USEC);

    /* Setup LPTimer using the HAL object and desired configuration as defined
     * in the device configurator. */
    cy_rslt_t result = mtb_hal_lptimer_setup(&lptimer_obj,
                                            &CYBSP_CM55_LPTIMER_1_hal_config);

    /* LPTimer setup failed. Stop program execution. */
    if (CY_RSLT_SUCCESS != result)
    {
        handle_app_error();
    }

    /* Pass the LPTimer object to abstraction RTOS library that implements
     * tickless idle mode
     */
    cyabs_rtos_set_lptimer(&lptimer_obj);
}


/*******************************************************************************
* Function Name: dc_irq_handler
********************************************************************************
* Summary:
*  Display Controller interrupt handler which gets invoked when the DC finishes
*  utilizing the current frame buffer.
*
* Parameters:
*  void
*
* Return:
*  void
*
*******************************************************************************/
static void dc_irq_handler(void)
{
    fb_pending = false;
    Cy_GFXSS_Clear_DC_Interrupt(base, &gfx_context);
}


/*******************************************************************************
* Function Name: gpu_irq_handler
********************************************************************************
* Summary:
*  GPU interrupt handler which gets invoked when the GPU finishes composing
*  a frame.
*
* Parameters:
*  void
*
* Return:
*  void
*
*******************************************************************************/
static void gpu_irq_handler(void)
{
    Cy_GFXSS_Clear_GPU_Interrupt(GFXSS, &gfx_context);
    vg_lite_IRQHandler();
}

/*******************************************************************************
* Function Name: disp_i2c_controller_interrupt
********************************************************************************
* Summary:
*  I2C controller ISR which invokes Cy_SCB_I2C_Interrupt to perform I2C transfer
*  as controller.
*
* Parameters:
*  void
*
* Return:
*  void
*
*******************************************************************************/
static void disp_i2c_controller_interrupt(void)
{
    Cy_SCB_I2C_Interrupt(CYBSP_I2C_CONTROLLER_HW, &disp_i2c_controller_context);
}

/*******************************************************************************
* Function Name: calculate_fps
********************************************************************************
* Summary:  
*  This function calculates the frames per second (FPS) based on the number of
*  frames rendered and the elapsed time since the last calculation.
*  It resets the frame count and start time after reaching the target number of
*  frames.

* Parameters:
*  void   
*  
* Return:
*  None
*******************************************************************************/
uint32_t idle_percent = 0;
void calculate_fps(void)
{
    static uint32_t start_time_ms = RESET_VAL;
    static uint32_t num_frames    = RESET_VAL;
    static uint32_t time_ms       = RESET_VAL;
    static uint32_t fps_x_1000    = RESET_VAL; 
    num_frames++;
    
    if (TARGET_NUM_FRAMES <= num_frames)
    {
        idle_percent = calculate_idle_percentage();
        time_ms = get_time_ms() - start_time_ms;
        fps_x_1000 = (num_frames * 1000 * 1000) / time_ms;

        printf("\rFPS: %u.%03u | CPU usage: %3u%%", (uint8_t)(fps_x_1000 / 1000),
                    (uint16_t)(fps_x_1000 % 1000),
                    (uint8_t)(100 - idle_percent));
        fflush(stdout);

        num_frames = RESET_VAL;
        start_time_ms = get_time_ms();
    }

}

/*******************************************************************************
* Function Name: cm55_gfx_task 
********************************************************************************
* Summary:
*   This is the FreeRTOS task callback function.
*   It initializes:  
*       - The selected display driver and vglite driver. 
*       - Allocate vglite buffers.
*       - Load an identity matrix into a matrix variable. 
*       - Translate the matrix to a new location.
*       - Scales the matrix in both horizontal and vertical directions.
*       - Call redraw function to draw the image using GPU and render it in 
*         framebuffer.
*
* Parameters:
*  void *arg: Pointer to the argument passed to the task (not used)
*
* Return:
*  void
*
*******************************************************************************/
static void cm55_gfx_task(void *arg)
{
    CY_UNUSED_PARAMETER(arg);

    cy_en_gfx_status_t status;
    vg_lite_error_t error;
    cy_en_sysint_status_t sysint_status;
    cy_en_scb_i2c_status_t i2c_result;
    event_t receive_event;
    bool success = true;

    /* --- Graphics Subsystem Initialization --- */
    status = Cy_GFXSS_Init(base, &GFXSS_config, &gfx_context);
    if (status != CY_GFX_SUCCESS)
    {
        printf("Graphics subsystem initialization failed: %d\r\n", status);
        success = false;
    }

    /* --- Initialize DC Interrupt --- */
    if (success)
    {
        sysint_status = Cy_SysInt_Init(&dc_irq_cfg, dc_irq_handler);
        if (sysint_status != CY_SYSINT_SUCCESS)
        {
            printf("Error in registering DC interrupt: %d\r\n", sysint_status);
            success = false;
        }
        else
        {
            NVIC_EnableIRQ(GFXSS_DC_IRQ);
        }
    }

    /* --- Initialize GPU Interrupt --- */
    if (success)
    {
        sysint_status = Cy_SysInt_Init(&gpu_irq_cfg, gpu_irq_handler);
        if (sysint_status != CY_SYSINT_SUCCESS)
        {
            printf("Error in registering GPU interrupt: %d\r\n", sysint_status);
            success = false;
        }
        else
        {
            Cy_GFXSS_Enable_GPU_Interrupt(base);
            NVIC_EnableIRQ(GFXSS_GPU_IRQ);
        }
    }

    /* --- I2C Initialization --- */
    if (success)
    {
        i2c_result = Cy_SCB_I2C_Init(CYBSP_I2C_CONTROLLER_HW,
                    &CYBSP_I2C_CONTROLLER_config, &disp_i2c_controller_context);

        if (i2c_result != CY_SCB_I2C_SUCCESS)
        {
            printf("I2C controller initialization failed !!\n");
            success = false;
        }
        else
        {
            sysint_status = Cy_SysInt_Init(&disp_i2c_controller_irq_cfg,
                                           &disp_i2c_controller_interrupt);
            if (sysint_status != CY_SYSINT_SUCCESS)
            {
                printf("I2C controller interrupt initialization failed\r\n");
                success = false;
            }
            else
            {
                NVIC_EnableIRQ(disp_i2c_controller_irq_cfg.intrSrc);
                Cy_SCB_I2C_Enable(CYBSP_I2C_CONTROLLER_HW);
            }
        }
    }

