Infineon/mtb-example-psoc-edge-gfx-vglite/proj_cm55/main.c
    vTaskDelay(pdMS_TO_TICKS(500));
    /* --- Display Initialization --- */
    if (success)
    {
        i2c_result = mtb_disp_waveshare_4p3_init(CYBSP_I2C_CONTROLLER_HW,
                                                 &disp_i2c_controller_context);
        if (i2c_result != CY_SCB_I2C_SUCCESS)
        {
            printf("Waveshare 4.3-Inch display init failed: %u\r\n", (unsigned int)i2c_result);
            success = false;
        }
    }

    /* --- VGLite Initialization --- */
    if (success)
    {
        vg_module_parameters_t vg_params;
        vg_params.register_mem_base = (uint32_t)GFXSS_GFXSS_GPU_GCNANO;
        vg_params.gpu_mem_base[VG_PARAMS_POS] = GPU_MEM_BASE;
        vg_params.contiguous_mem_base[VG_PARAMS_POS] = (volatile void *) vglite_heap_base;
        vg_params.contiguous_mem_size[VG_PARAMS_POS] = VGLITE_HEAP_SIZE;

        vg_lite_init_mem(&vg_params);

        error = vg_lite_init(DISP_W, DISP_H);
        if (error != VG_LITE_SUCCESS)
        {
            printf("vg_lite engine init failed: %d\r\n", error);
            success = false;
        }
    }

    /* --- Buffers Setup --- */
    if (success)
    {
        buffer0.width  = DISP_W_ACTUAL;
        buffer0.height = DISP_H;
        buffer0.format = VG_LITE_BGR565;
        error = vg_lite_allocate_with_align(&buffer0,ALIGN_128);
        if (error)
        {
            printf("Buffer0 allocation failed: %d\r\n", error);
            success = false;
        }
        else
        {
            render_target = &buffer0;
        }
    }

    if (success)
    {
        buffer1.width  = DISP_W_ACTUAL;
        buffer1.height = DISP_H;
        buffer1.format = VG_LITE_BGR565;
        error = vg_lite_allocate_with_align(&buffer1,ALIGN_128);
        if (error)
        {
            printf("Buffer1 allocation failed: %d\r\n", error);
            success = false;
        }
    }

    if (success)
    {
        intermediate_buffer.width  = DISP_W/2;
        intermediate_buffer.height = DISP_H/2;
        intermediate_buffer.format = VG_LITE_BGR565;
        error = vg_lite_allocate(&intermediate_buffer);
        if (error)
        {
            printf("Intermediate buffer allocation failed: %d\r\n", error);
            success = false;
        }
    }

    /* --- Image/Logo Initialization --- */
    if (success)
    {
        error = vg_lite_clear(render_target, NULL, WHITE_COLOR);
        if (error)
        {
            printf("Clear failed: %d\r\n", error);
            success = false;
        }
    }

    if (success)
    {
        vg_lite_identity(&matrix);

        if (!load_images())
        {
            printf("Failed to load icons\r\n");
            success = false;
        }
        else
        {
            vg_lite_translate(DISP_W / TRANSFORMATION_OFFSET,
                              DISP_H / TRANSFORMATION_OFFSET,
                              &matrix);
            vg_lite_scale(DEF_X_SCALE, DEF_Y_SCALE, &matrix);
        }
    }

    /* --- Final Task Loop --- */
    if (success)
    {
        for (;;)
        {
            if (xQueueReceive(event_queque, &receive_event, 0) == pdTRUE)
            {
                if (receive_event.b_event < (sizeof(event_handlers)/sizeof(event_handlers[0])) &&
                    event_handlers[receive_event.b_event] != NULL)
                {
                    cancel_requested = false;
                    while (!cancel_requested)
                    {
                        event_handlers[receive_event.b_event]();
                        vTaskDelay(pdMS_TO_TICKS(GFX_TASK_DELAY_MS));
                    }
                    scale_count = RESET_VAL;
                    zoom_out    = false;
                    vg_lite_identity(&matrix);
                    vg_lite_translate(DISP_W / TRANSFORMATION_OFFSET,
                                      DISP_H / TRANSFORMATION_OFFSET,
                                      &matrix);
                    vg_lite_scale(DEF_X_SCALE, DEF_Y_SCALE, &matrix);
                }
            }

            default_draw();
            vTaskDelay(pdMS_TO_TICKS(GFX_TASK_DELAY_MS));
        }
    }
    else
    {
        cleanup(EVENT_DEFAULT,EXIT_2);
    }
}



/*******************************************************************************
* Function Name: setup_clib_support
********************************************************************************
* Summary:
*    1. This function configures and initializes the Real-Time Clock (RTC).
*    2. It then initializes the RTC HAL object to enable CLIB support library 
*       to work with the provided Real-Time Clock (RTC) module.
*
* Parameters:
*  void
*
* Return:
*  void
*
*******************************************************************************/
static void setup_clib_support(void)
{
    /* RTC Initialization */
    Cy_RTC_Init(&CYBSP_RTC_config);
    Cy_RTC_SetDateAndTime(&CYBSP_RTC_config);

    /* Initialize the ModusToolbox CLIB support library */
    mtb_clib_support_init(&rtc_obj);
}


/*******************************************************************************
* Function Name: main
********************************************************************************
* Summary:
*  This is the main function for CM55 non-secure application.
*    1. It initializes the device and board peripherals.
*    2. It sets up the LPtimer instance for CM55 CPU and initializes debug UART. 
*    3. It creates the FreeRTOS application task 'cm55_gfx_task'.
*    4. It starts the RTOS task scheduler.
*
* Parameters:
*  void
*
* Return:
*  int
*
*******************************************************************************/
int main(void)
{
    cy_rslt_t result       = CY_RSLT_SUCCESS;
    BaseType_t task_return = pdFAIL;
    BaseType_t uxQueueLength = 10;
    /* Initialize the device and board peripherals */
    result = cybsp_init();
    
    /* Board initialization failed. Stop program execution */
    if (CY_RSLT_SUCCESS != result)
    {
        handle_app_error();
    }

    /* Setup CLIB support library. */
    setup_clib_support();

    /* Setup the LPTimer instance for CM55*/
    setup_tickless_idle_timer();

    /* Initialize retarget-io middleware */
    init_retarget_io();

    /* Enable global interrupts */
    __enable_irq();
    
    event_queque = xQueueCreate(uxQueueLength, sizeof(event_t));
    if (event_queque == NULL) 
    {
        printf("Failed to create event queue\r\n");
        handle_app_error();
    }
    /* Create the FreeRTOS Task */
    task_return = xTaskCreate(cm55_gfx_task, GFX_TASK_NAME,
                              GFX_TASK_STACK_SIZE, NULL,
                              GFX_TASK_PRIORITY, NULL);

    task_return = xTaskCreate(uart_cli_handler, UART_CLI_TASK_NAME,
                              UART_CLI_TASK_STACK_SIZE,
                              NULL, UART_CLI_TASK_PRIORITY, NULL);
    
    if (pdPASS == task_return)
    {
        /* Start the RTOS Scheduler */
        vTaskStartScheduler();

        /* Should never get here! */
        handle_app_error();
    }
    else
    {
        printf("Error: Failed to create cm55_gfx_task.\r\n");
        handle_app_error();
    }
}


/*******************************************************************************
* Function Name: swap_frame_buffer
********************************************************************************
* Summary:
*  This function waits for any pending frame buffer operation, sets the 
*  Video/Graphics layer frame buffer to the display controller, and swaps 
*  between two render buffers. It also updates the FPS statistics.
*
* Parameters:
*  void
*
* Return:
*  void
*
*******************************************************************************/
void swap_frame_buffer( void ) 
{
    static int current_buffer = RESET_VAL;

    while (fb_pending);

    fb_pending = true;
    
    /* Sets Video/Graphics layer buffer address and transfers the frame buffer
       to the Display Controller */
    Cy_GFXSS_Set_FrameBuffer(base, (uint32_t*) render_target->address, &gfx_context);

    /* Swap buffers */
    render_target = (current_buffer) ? &buffer0 : &buffer1;
    current_buffer ^= 1;

    /* Update frame rate statistics */
    calculate_fps();
}

/* [] END OF FILE */
